app/views/users/show.html.erb

        <%if params[:id].scan(/[a-zA-Z]/).size == 0%>
            <%found_user = User.find(params[:id].to_i)%>
        <%else%>
            <%found_user = User.where(first_name: params[:id]).first %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 41 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."first_name" = 'show' ORDER BY "users"."id" ASC LIMIT 1