app/views/gossips/show.html.erb

            <h1>Bienvenue sur la page gossip !</h1>
            <%= Gossip.find(params['id']).user.first_name%><br>
            <%= Gossip.find(params['id']).user.last_name%><br>
            <%= Gossip.find(params['id']).content%><br>
            <%= Gossip.find(params['id']).created_at%><br>
            <a href= "/welcome/<%=Gossip.find(params['id']).user.id%>">Page de l'utilisateur</a><br>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 21 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 17 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 19 LIMIT 1