app/views/static/index.erb

        <div>
            <%for n in Gossip.all do %>
                <h2><%= n.title%></h2>
                <%= "#{n.user.first_name} #{n.user.last_name}" %><br>
---
SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users" WHERE "users"."id" = 17 LIMIT 1