app/views/static/index.erb

        <h2>Découvre ici toute la liste des potins déjà rédigés !</h2>
        <%for n in Gossip.all do %>
            <h2><%= n.title%></h2>
            <%= "#{n.user.first_name} #{n.user.last_name}" %>
---
SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1