app/controllers/gossips_controller.rb

  def index
    @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def show
    # Méthode qui récupère le potin concerné et l'envoie à la view show (show.html.erb) pour affichage
      @gossip = Gossip.find(params[:id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 2 LIMIT 1

  def create
    # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
       user = User.find_by(first_name: "Anonymous")
      @gossip = Gossip.new(
      title: params[:title],
      content: params[:content],
      user: anonymous_user
    )
      if @gossip.save
---
SELECT "users".* FROM "users" WHERE "users"."first_name" = 'Anonymous' LIMIT 1
INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "user_id") VALUES ('hudiskbl ', 'bcdjzlbvhjq', '2025-10-09 13:00:26.638703', '2025-10-09 13:00:26.638703', 64) RETURNING "id"

  def anonymous_user
  User.find_by(first_name: "Anonymous")
---
SELECT "users".* FROM "users" WHERE "users"."first_name" = 'Anonymous' LIMIT 1